phildrip/tesla-ble-zig/standalone/sdkconfig.defaults
# ESP-IDF SDK configuration defaults for pure-Zig Tesla BLE firmware
CONFIG_IDF_TARGET="esp32c6"

# Configure Bluetooth Stack to use NimBLE (C-native stack, highly efficient)
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3

# Memory and Partition sizes
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Wi-Fi configurations
CONFIG_ESP_WIFI_ENABLED=y

# Custom Tesla BLE Configuration Defaults
CONFIG_WIFI_SSID="GIGANET_QHYJO4"
CONFIG_WIFI_PASSWORD="ridden-simply-submersed"
CONFIG_MQTT_BROKER_URL="mqtt://homeassistant.local:1883"
CONFIG_VEHICLE_VIN="LRWYHCEK8PC729294"
